Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/svd/PIC32CX1025MTG64.svd
            <register>
               <name>TCR</name>
               <description>Tamper Control Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TAMPEN0</name>
                     <description>Timestamping on TMPx input is enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TAMPEN0Select</name>
                        <enumeratedValue>
                           <name>TIMESTAMP_OFF</name>
                           <description>Tamper event on TMPx input is not timestamped.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIMESTAMP_ON</name>
                           <description>Tamper event on TMPx input is timestamped.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TAMPEN1</name>
                     <description>Timestamping on TMPx input is enabled</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TAMPEN1Select</name>
                        <enumeratedValue>
                           <name>TIMESTAMP_OFF</name>
                           <description>Tamper event on TMPx input is not timestamped.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIMESTAMP_ON</name>
                           <description>Tamper event on TMPx input is timestamped.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TAMPEN2</name>
                     <description>Timestamping on TMPx input is enabled</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TAMPEN2Select</name>
                        <enumeratedValue>
                           <name>TIMESTAMP_OFF</name>
                           <description>Tamper event on TMPx input is not timestamped.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIMESTAMP_ON</name>
                           <description>Tamper event on TMPx input is timestamped.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TAMPEN3</name>
                     <description>Timestamping on TMPx input is enabled</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TAMPEN3Select</name>
                        <enumeratedValue>
                           <name>TIMESTAMP_OFF</name>
                           <description>Tamper event on TMPx input is not timestamped.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIMESTAMP_ON</name>
                           <description>Tamper event on TMPx input is timestamped.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TAMPEN4</name>
                     <description>Timestamping on TMPx input is enabled</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TAMPEN4Select</name>
                        <enumeratedValue>
                           <name>TIMESTAMP_OFF</name>
                           <description>Tamper event on TMPx input is not timestamped.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIMESTAMP_ON</name>
                           <description>Tamper event on TMPx input is timestamped.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TAMPCLR</name>
                     <description>Tamper Clear</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TAMPCLRSelect</name>
                        <enumeratedValue>
                           <name>NOT_ENABLE</name>
                           <description>A Tamper event does not create an immediate clear on GPBR registers.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Tamper event on TMP0 or TMP4 generates an immediate clear on GPBR registers. The number of cleared GPBR registers depends on the value of FGPBRCLR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FGPBRCLR</name>
                     <description>Full GPBR Clear</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FGPBRCLRSelect</name>
                        <enumeratedValue>
                           <name>HALF</name>
                           <description>If TAMPCLR is set to '1', a tamper event immediately clears GPBR0 to GPBR11.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FULL</name>
                           <description>If TAMPCLR is set to '1', a tamper event immediately clears all GPBRs.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TISR</name>
               <description>Tamper Input Status Register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TISR0</name>
                     <description>TMPx Input Status Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TISR1</name>
                     <description>TMPx Input Status Register</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TISR2</name>
                     <description>TMPx Input Status Register</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TISR3</name>
                     <description>TMPx Input Status Register</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TISR4</name>
                     <description>TMPx Input Status Register</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>5</dim>
               <dimIncrement>16</dimIncrement>
               <name>RTC_SUB0[%s]</name>
               <description/>
               <addressOffset>0x40</addressOffset>
               <register>
                  <name>FSTR</name>
                  <description>First Stamping Time Register of Source 0</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>SEC</name>
                        <description>Seconds of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>MIN</name>
                        <description>Minutes of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>HOUR</name>
                        <description>Hours of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>AMPM</name>
                        <description>AM/PM Indicator of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TEVCNT</name>
                        <description>Tamper Events Counter (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>BACKUP</name>
                        <description>System Mode of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FSTR_UTC_MODE_MODE</name>
                  <description>First Stamping Time Register of Source 0</description>
                  <alternateRegister>FSTR</alternateRegister>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>TEVCNT</name>
                        <description>Tamper Events Counter (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>BACKUP</name>
                        <description>System Mode of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FSDR</name>
                  <description>First Stamping Date Register of Source 0</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>CENT</name>
                        <description>Century of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>YEAR</name>
                        <description>Year of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>MONTH</name>
                        <description>Month of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>DAY</name>
                        <description>Day of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>DATE</name>
                        <description>Date of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FSDR_UTC_MODE_MODE</name>
                  <description>First Stamping Date Register of Source 0</description>
                  <alternateRegister>FSDR</alternateRegister>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>UTC_TIME</name>
                        <description>Time of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LSTR</name>
                  <description>Last Stamping Time Register of Source 0</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>SEC</name>
                        <description>Seconds of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>MIN</name>
                        <description>Minutes of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>HOUR</name>
                        <description>Hours of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>AMPM</name>
                        <description>AM/PM Indicator of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BACKUP</name>
                        <description>System Mode of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LSTR_UTC_MODE_MODE</name>
                  <description>Last Stamping Time Register of Source 0</description>
                  <alternateRegister>LSTR</alternateRegister>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>BACKUP</name>
                        <description>System Mode of the Tamper (cleared by reading RTC_LSDRx)</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LSDR</name>
                  <description>Last Stamping Date Register of Source 0</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>CENT</name>
                        <description>Century of the Tamper (cleared on read)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>YEAR</name>
                        <description>Year of the Tamper (cleared on read)</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>MONTH</name>
                        <description>Month of the Tamper (cleared on read)</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>DAY</name>
                        <description>Day of the Tamper (cleared on read)</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>DATE</name>
                        <description>Date of the Tamper (cleared on read)</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LSDR_UTC_MODE_MODE</name>
                  <description>Last Stamping Date Register of Source 0</description>
                  <alternateRegister>LSDR</alternateRegister>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>UTC_TIME</name>
                        <description>Time of the Tamper (cleared on read)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
